CSI API ETABS v1

# cOAPIApplicationStart Method

---

This function starts the application.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int ApplicationStart()

    Function ApplicationStart As Integer

    Dim instance As cOAPI
    Dim returnValue As Integer

    returnValue = instance.ApplicationStart()

    int ApplicationStart()

    abstract ApplicationStart : unit -> int

#### Return Value

Type: Int32
This function returns zero if the application successfully starts and nonzero
if it fails.

Remarks

When the model is not visible it does not appear on screen and it does not
appear in the Windows task bar.

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cOAPI Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com